In [40]:
import pandas as pd
import numpy as np

In [6]:
mylist = [5,4,33,12,76]
myarray = np.array(mylist)
print(myarray)

[ 5  4 33 12 76]

In [7]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=myarray)
print(myseries2)

0     5
1     4
2    33
3    12
4    76
dtype: int64
0     5
1     4
2    33
3    12
4    76
dtype: int32

In [5]:
print(myseries1[2])

3

In [8]:
mylables = ['1th','2th','3th','4th','5th']
myseries3 = pd.Series(data=mylist,index=mylables)
print(myseries3)

1th     5
2th     4
3th    33
4th    12
5th    76
dtype: int64

In [9]:
print(myseries3['3th'])

33

In [10]:
myseries4 = pd.Series([2,3,4,1,6],['1th','3th','4th','6th','7th'])
print(myseries4)
print('')
print(myseries3+myseries4)

1th    2
3th    3
4th    4
6th    1
7th    6
dtype: int64

1th     7.0
2th     NaN
3th    36.0
4th    16.0
5th     NaN
6th     NaN
7th     NaN
dtype: float64

In [16]:
df1 = pd.concat([myseries3,myseries4],axis=1,sort=True)
df1

        0    1
1th   5.0  2.0
2th   4.0  NaN
3th  33.0  3.0
4th  12.0  4.0
5th  76.0  NaN
6th   NaN  1.0
7th   NaN  6.0

# Modifying a DataFrame

In [18]:
df2 = pd.DataFrame(np.random.randn(5,5),index=['1th row','2th row','3th row','4th row','5th row'],columns=['1th col','2th col','3th col','4th col','5th col'])
df2

          1th col   2th col   3th col   4th col   5th col
1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605
2th row  0.145061  1.774708  0.780958  0.996805  0.780980
3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458
4th row -1.033275  0.667603  0.286494 -0.132871  0.801185
5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316

In [22]:
df2[['2th col','5th col']]

          2th col   5th col
1th row -0.516739 -0.582605
2th row  1.774708  0.780980
3th row -0.147782  0.713458
4th row  0.667603  0.801185
5th row  1.700104 -0.905316

In [25]:
df2.loc[['2th row' ,'4th row'],['1th col','3th col']]

          1th col   3th col
2th row  0.145061  0.780958
4th row -1.033275  0.286494

In [26]:
df2>0

         1th col  2th col  3th col  4th col  5th col
1th row     True    False     True    False    False
2th row     True     True     True     True     True
3th row     True    False    False    False     True
4th row    False     True     True    False     True
5th row     True     True    False     True    False

In [28]:
df2[df2>0]

          1th col   2th col   3th col   4th col   5th col
1th row  0.847794       NaN  0.250755       NaN       NaN
2th row  0.145061  1.774708  0.780958  0.996805  0.780980
3th row  0.662552       NaN       NaN       NaN  0.713458
4th row       NaN  0.667603  0.286494       NaN  0.801185
5th row  0.302512  1.700104       NaN  1.304873       NaN

In [29]:
df2['6th col'] = np.random.randn(5,1)
df2

          1th col   2th col   3th col   4th col   5th col   6th col
1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [30]:
df2.drop('3th col',axis=1)

          1th col   2th col   4th col   5th col   6th col
1th row  0.847794 -0.516739 -0.210721 -0.582605 -0.388806
2th row  0.145061  1.774708  0.996805  0.780980 -1.829623
3th row  0.662552 -0.147782 -0.932024  0.713458  1.218539
4th row -1.033275  0.667603 -0.132871  0.801185  0.297538
5th row  0.302512  1.700104  1.304873 -0.905316 -0.319172

In [31]:
df2

          1th col   2th col   3th col   4th col   5th col   6th col
1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [32]:
 df2.reset_index()

     index   1th col   2th col   3th col   4th col   5th col   6th col
0  1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
1  2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
2  3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
3  4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
4  5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [33]:
df2

          1th col   2th col   3th col   4th col   5th col   6th col
1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [34]:
df2.reset_index(inplace=True)
df2

     index   1th col   2th col   3th col   4th col   5th col   6th col
0  1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
1  2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
2  3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
3  4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
4  5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [35]:
df2

     index   1th col   2th col   3th col   4th col   5th col   6th col
0  1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
1  2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
2  3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
3  4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
4  5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [36]:
df2['S/no']=['#','#','#','#','#']
df2

     index   1th col   2th col   3th col   4th col   5th col   6th col S/no
0  1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806    #
1  2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623    #
2  3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539    #
3  4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538    #
4  5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172    #

In [37]:
df2.set_index('S/no',inplace=True)
df2

        index   1th col   2th col   3th col   4th col   5th col   6th col
S/no
#     1th row  0.847794 -0.516739  0.250755 -0.210721 -0.582605 -0.388806
#     2th row  0.145061  1.774708  0.780958  0.996805  0.780980 -1.829623
#     3th row  0.662552 -0.147782 -0.053733 -0.932024  0.713458  1.218539
#     4th row -1.033275  0.667603  0.286494 -0.132871  0.801185  0.297538
#     5th row  0.302512  1.700104 -2.118665  1.304873 -0.905316 -0.319172

In [38]:
df2.mean()

1th col    0.184929
2th col    0.695579
3th col   -0.170838
4th col    0.205212
5th col    0.161540
6th col   -0.204305
dtype: float64

# Combining DataFrames

<h2>Concat</h2>

In [3]:
df3 = pd.DataFrame({"Customer":['101','102','103','104'],'Category':['cat2','cat2','cat1','cat3'],'Important':['Y','N','Y','Y'],'Sales':[123,52,214,663]})
df4 = pd.DataFrame({"Customer":['101','103','103','105'],'Color':['yellow','green','green','blue'],'Distance':[12,9,44,21],'Sales':[123,214,663,331]})

In [8]:
pd.concat([df3,df4],axis=0,sort=True)

  Category   Color Customer  Distance Important  Sales
0     cat2     NaN      101       NaN         Y    123
1     cat2     NaN      102       NaN         N     52
2     cat1     NaN      103       NaN         Y    214
3     cat3     NaN      104       NaN         Y    663
0      NaN  yellow      101      12.0       NaN    123
1      NaN   green      103       9.0       NaN    214
2      NaN   green      103      44.0       NaN    663
3      NaN    blue      105      21.0       NaN    331

In [9]:
pd.concat([df3,df4],axis=1,sort=True)

  Customer Category Important  Sales Customer   Color  Distance  Sales
0      101     cat2         Y    123      101  yellow        12    123
1      102     cat2         N     52      103   green         9    214
2      103     cat1         Y    214      103   green        44    663
3      104     cat3         Y    663      105    blue        21    331

<h2>Merge and Join</h2>

In [25]:
pd.merge(df3,df4,how='outer')

  Customer Category Important  Sales   Color  Distance
0      101     cat2         Y    123  yellow      12.0
1      102     cat2         N     52     NaN       NaN
2      103     cat1         Y    214   green       9.0
3      104     cat3         Y    663     NaN       NaN
4      103      NaN       NaN    663   green      44.0
5      105      NaN       NaN    331    blue      21.0

In [26]:
pd.merge(df3,df4,how='inner')

  Customer Category Important  Sales   Color  Distance
0      101     cat2         Y    123  yellow        12
1      103     cat1         Y    214   green         9

In [27]:
pd.merge(df3,df4,how='left')

  Customer Category Important  Sales   Color  Distance
0      101     cat2         Y    123  yellow      12.0
1      102     cat2         N     52     NaN       NaN
2      103     cat1         Y    214   green       9.0
3      104     cat3         Y    663     NaN       NaN

In [28]:
pd.merge(df3,df4,how='right')

  Customer Category Important  Sales   Color  Distance
0      101     cat2         Y    123  yellow        12
1      103     cat1         Y    214   green         9
2      103      NaN       NaN    663   green        44
3      105      NaN       NaN    331    blue        21

In [9]:
df5 = pd.DataFrame({'Q1':[101,102,103],
                    'Q2':[201,202,201]},
                    index=['I0','I1','I2'])
df6 = pd.DataFrame({'Q3':[301,302,303],
                    'Q4':[401,402,401]},
                    index=['I0','I2','I3'])

In [37]:
df5.join(df6,how='outer')

       Q1     Q2     Q3     Q4
I0  101.0  201.0  301.0  401.0
I1  102.0  202.0    NaN    NaN
I2  103.0  201.0  302.0  402.0
I3    NaN    NaN  303.0  401.0

In [38]:
df5.join(df6,how='inner')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  201  302  402

In [6]:
df4['Color'].unique()

array(['yellow', 'green', 'blue'], dtype=object)

In [7]:
df4['Color'].value_counts()

green     2
blue      1
yellow    1
Name: Color, dtype: int64

In [10]:
df5.mean()

Q1    102.000000
Q2    201.333333
dtype: float64

In [12]:
new_df = df4[(df4['Customer']!='105')&(df4['Color']!='green')]
new_df

  Customer   Color  Distance  Sales
0      101  yellow        12    123

In [15]:
print(df4['Sales'].mean(),df4['Sales'].sum())
print(df4['Distance'].min())

332.75 1331
9

In [17]:
def profit(s):
    return s*0.5

In [18]:
df4['Sales'].apply(profit)

0     61.5
1    107.0
2    331.5
3    165.5
Name: Sales, dtype: float64

In [20]:
df7 = df4[['Distance','Sales']]
df7.applymap(profit) #applymap works entry by entry only in dataframe

   Distance  Sales
0       6.0   61.5
1       4.5  107.0
2      22.0  331.5
3      10.5  165.5

In [21]:
def col_sum(co):
    return sum(co)
df7.apply(col_sum)

Distance      86
Sales       1331
dtype: int64

In [22]:
df4.sort_values(by='Distance')

  Customer   Color  Distance  Sales
1      103   green         9    214
0      101  yellow        12    123
3      105    blue        21    331
2      103   green        44    663

In [26]:
mydict = {'customer':['customer1','customer1','customer2','customer2','customer3','customer3'],'product1':[1.1,2.1,3.8,4.2,5.5,6.9],'product2':[8.2,9.1,11.1,5.2,44.66,983]}
df8 = pd.DataFrame(mydict,index=['purchase 1','purchase 2','purchase 3','purchase 4','purchase 5','purchase 6'])
df8

             customer  product1  product2
purchase 1  customer1       1.1      8.20
purchase 2  customer1       2.1      9.10
purchase 3  customer2       3.8     11.10
purchase 4  customer2       4.2      5.20
purchase 5  customer3       5.5     44.66
purchase 6  customer3       6.9    983.00

In [30]:
grouped_data = df8.groupby('customer')
grouped_data.describe()

          product1                                           product2          \
             count mean       std  min   25%  50%   75%  max    count    mean
customer
customer1      2.0  1.6  0.707107  1.1  1.35  1.6  1.85  2.1      2.0    8.65
customer2      2.0  4.0  0.282843  3.8  3.90  4.0  4.10  4.2      2.0    8.15
customer3      2.0  6.2  0.989949  5.5  5.85  6.2  6.55  6.9      2.0  513.83


                  std    min      25%     50%      75%    max
customer
customer1    0.636396   8.20    8.425    8.65    8.875    9.1
customer2    4.171930   5.20    6.675    8.15    9.625   11.1
customer3  663.506577  44.66  279.245  513.83  748.415  983.0

In [31]:
grouped_data.mean()

           product1  product2
customer
customer1       1.6      8.65
customer2       4.0      8.15
customer3       6.2    513.83

In [42]:
df4.to_csv('df4.csv',index=True)

In [44]:
new_df4 = pd.read_csv('df4.csv',index_col=0)
new_df4

   Customer  Distance  Sales
0       101        12    123
1       103         9    214
2       103        44    663
3       105        21    331

In [50]:
df4.to_excel('df4.xlsx',index=False,sheet_name='First Sheet')
new_df4_exl = pd.read_excel('df4.xlsx',sheet_name='First Sheet',index_col=0)
new_df4_exl

          Distance  Sales
Customer
101             12    123
103              9    214
103             44    663
105             21    331